#include <stdio.h>
/* 题目描述 
巴巴乐园大二班一共N个小朋友(3<N<50)，每个小朋友有一个固定的学号(编号范围为[1 N]，每人对应1~N中的一个数字)。
游戏课时，小朋友们随机的站成了一排(从左到右，左边为第一个位置)，老师需要重新调整队伍排列顺序，调整后当队列首
尾相连时形成一个圈状的序列，从某个小朋友的学号向后数至该小朋友的前一个小朋友，小朋友的学号都是从小到大按数字
递增排列的(如4个小朋友排队，满足条件的排列方式有1,2,3,4；2,3,4,1；3,4,1,2；4,1,2,3四个)。但老师每次只能把
队伍中的任意一个小朋友移到队伍左边第一个位置。请你帮助老师计算出需要小朋友移动的最小次数。

输入描述
输入小朋友排队的学号顺序(从左到右)

输出描述
最少移动次数

示例
输入样例 
5 2 1 3 4
5 2 3 6 1 4 7
4 2 3 1 7 6 5 8 9
15 6 1 9 3 5 14 11 10 8 7 13 12 2 4
25 1 33 13 35 2 15 6 3 4 36 5 28 7 8 38 10 14 40 31 16 19 20 27 11 23 12 24 29 30 17 32 18 26 34 22 37 9 21 39
输出样例 
2
4
6
12
35 */
int main()
{
   
    return 0;
}