#include <bits/stdc++.h>

using namespace std;
/* [编程题]天弃之子
有一款游戏，过关的方式是按按钮。
游戏一共有关，每一关有个按钮，其中只有唯一一个按钮是可以通关的，按下其他的按钮游戏就会失败。
好在这个游戏可以重来，而且由于设计者的疏忽，每一关的通关按钮是不变的，所以你可以记住前几关的按钮，
重来时就可以直接通关。
但是...你的运气似乎用在了其他地方，你使用了最多的按按钮次数才成功通关。
求这个最多的按按钮次数吧！

输入例子1:
[1,1,4,5,1,4]

输出例子1:
49

输入例子2:
[2,2,2]

输出例子2:
9

例子说明2:
第一关消耗两次得到通关按钮后直接进入第二关，经历一次失败后重新来到第二关得到通关按钮进入第三关，
再失败一次后直接通关，消耗次数为1+2+3+3=9 */

class Solution {
public:
    /**
     * 代码中的类名、方法名、参数名已经指定，请勿修改，直接返回方法规定的值即可
     *
     * 
     * @param buttons int整型vector 
     * @return long长整型
     */
    long long findMaxButtons(vector<int>& buttons) {
        // write code here
    }
};
int main(){

    return 0;
}